uhnp/src/Reports/ПараметрыВНА/ПараметрыВНА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПараметрыВНА</name>
</mdclass:Report>

uhnp/src/AccumulationRegisters/СтоимостьВНАМСФО/СтоимостьВНАМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьВНАМСФО</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Переоценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Обесценение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезервПереоценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереоценкаАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПартии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВНА</name>
    <type>
      <types>DefinedType.ИсточникВНА</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчета</name>
    <type>
      <types>EnumRef.ВидыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаВНА</name>
    <type>
      <types>CatalogRef.ГруппыВНАМСФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/InformationRegisters/ПараметрыУчетаВНАМСФО/ПараметрыУчетаВНАМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыУчетаВНАМСФО</name>
  <comment>Изменять раз в месяц</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГруппаВНА</name>
    <type>
      <types>CatalogRef.ГруппыВНАМСФО</types>
    </type>
  </resources>
  <resources>
    <name>ТипВНА</name>
    <type>
      <types>EnumRef.ТипыВНА</types>
    </type>
  </resources>
  <resources>
    <name>СпособПоступления</name>
    <type>
      <types>EnumRef.СпособыПоступленияОбъектовВНА</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПервоначальнойСтоимости</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПервоначальнойСтоимостиСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПервоначальнойСтоимостиСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПервоначальнойСтоимостиСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>СчетНакопленнойАмортизации</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </resources>
  <resources>
    <name>СчетНакопленнойАмортизацииСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>СчетНакопленнойАмортизацииСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>СчетНакопленнойАмортизацииСубконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <dimensions>
    <name>ВНА</name>
    <type>
      <types>DefinedType.ИсточникВНА</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчета</name>
    <type>
      <types>EnumRef.ВидыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccountingRegisters/МСФО/МСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>МСФО</name>
  <chartOfAccounts>ChartOfAccounts.МСФО</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>CatalogRef.ВидыОпераций</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>СуммаВВалютеУчета</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалютеОтчетности</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.МСФО.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетДтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКтИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоДт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоКт</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхДляРасчетов</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/InformationRegisters/ПараметрыАмортизацииВНАМСФО/ПараметрыАмортизацииВНАМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыАмортизацииВНАМСФО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемПродукцииРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиВНА</types>
    </type>
  </resources>
  <resources>
    <name>СпособНачисленияАмортизации</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииВНА</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияРасходовПоАмортизации</name>
    <type>
      <types>DefinedType.ПрофильРаспределенияВНАНСБУ</types>
    </type>
  </resources>
  <resources>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <comment>При алгоритме БП: не используется</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <comment>При алгоритме БП: изменяется только модернизацией</comment>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ПараметрыАмортизации</name>
    <type>
      <types>CatalogRef.ПараметрыАмортизацииВНАМСФО</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВНА</name>
    <type>
      <types>DefinedType.ИсточникВНА</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчета</name>
    <type>
      <types>EnumRef.ВидыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccumulationRegisters/ВыработкаВНА/ВыработкаВНА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыработкаВНА</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВНА</name>
    <type>
      <types>DefinedType.ИсточникВНА</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрВыработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиВНА</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчета</name>
    <type>
      <types>EnumRef.ВидыУчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Enums/ВидыСчетовБД/ВидыСчетовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСчетовБД</name>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>Пассивный</name>
  </enumValues>
  <enumValues>
    <name>АктивноПассивный</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыУчета/ВидыУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУчета</name>
  <enumValues>
    <name>НСБУ</name>
  </enumValues>
  <enumValues>
    <name>МСФО</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыПоступленияОбъектовВНА/СпособыПоступленияОбъектовВНА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПоступленияОбъектовВНА</name>
  <enumValues>
    <name>Приобретено</name>
  </enumValues>
  <enumValues>
    <name>ПолученоВКачествеВзносаВУК</name>
  </enumValues>
  <enumValues>
    <name>ПолученоПоДоговоруДарения</name>
  </enumValues>
  <enumValues>
    <name>ПолученоПоДоговоруМены</name>
  </enumValues>
  <enumValues>
    <name>СтроительствоСоздание</name>
  </enumValues>
  <enumValues>
    <name>БезвозмездноеПоступление</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговоруАренды</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговоруЛизинга</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеВДоверительноеУправление</name>
  </enumValues>
  <enumValues>
    <name>ВкладВСовместнуюДеятельность</name>
  </enumValues>
  <enumValues>
    <name>Иное</name>
  </enumValues>
  <enumValues>
    <name>Рекласс</name>
  </enumValues>
  <enumValues>
    <name>ВосстановленИзРасходов</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СпособыНачисленияАмортизацииВНА/СпособыНачисленияАмортизацииВНА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыНачисленияАмортизацииВНА</name>
  <enumValues>
    <name>Линейный</name>
  </enumValues>
  <enumValues>
    <name>УменьшаемогоОстатка</name>
  </enumValues>
  <enumValues>
    <name>ПропорциональноОбъемуПродукции</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Reports/ПараметрыВНА/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ТекстЗапроса_ПараметрыВНА(КонтекстЗапроса = Неопределено, ТаблицаДляПомещения = Неопределено, ЕстьТУВНА = Ложь) Экспорт 

	НомераТаблиц = ?(ЗначениеЗаполнено(КонтекстЗапроса), КонтекстЗапроса.НомераТаблиц, Новый Структура);
	ТекстЗапроса = ?(ЗначениеЗаполнено(КонтекстЗапроса), КонтекстЗапроса.ТекстЗапроса, Новый Массив);
	
	ТекстЗапроса.Добавить(ТекстЗапроса_втСтоимостьВНАПУ(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втРазделыВНА(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втСчетаТрансляцииВНА(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втПараметрыУчетаВНАМСФО(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втСтоимостьВНАМСФО(НомераТаблиц, ЕстьТУВНА));
	ТекстЗапроса.Добавить(ТекстЗапроса_втПараметрыАмортизацииВНАМСФО(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втВыработкаВНА(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_втБазыРасчета(НомераТаблиц));
	ТекстЗапроса.Добавить(ТекстЗапроса_ТаблицаПараметрыВНА(НомераТаблиц, ТаблицаДляПомещения));
	
	Возврат СтрСоединить(ТекстЗапроса, ОбщегоНазначенияУХВызовСервера.ТекстРазделителяЗапросовПакета());

КонецФункции

Процедура ЗаполнитьПараметрыЗапроса(Запрос, ДокументДата, ДокументСсылка, АлгоритмРСБУ = Неопределено) Экспорт

	ПараметрыЗапроса = ПолучитьДатыЗапросаПараметровВНА(ДокументДата, ДокументСсылка, АлгоритмРСБУ);
	
	Для каждого ТекущийПараметр Из ПараметрыЗапроса Цикл	
		Запрос.УстановитьПараметр(ТекущийПараметр.Ключ, ТекущийПараметр.Значение);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыСКД(НастройкиСКД, ДокументДата, ДокументСсылка, АлгоритмРСБУ = Неопределено) Экспорт

	ПараметрыЗапроса = ПолучитьДатыЗапросаПараметровВНА(ДокументДата, ДокументСсылка, АлгоритмРСБУ);
	
	Для каждого ТекущийПараметр Из ПараметрыЗапроса Цикл	
		НастройкиСКД.ПараметрыДанных.УстановитьЗначениеПараметра(ТекущийПараметр.Ключ, ТекущийПараметр.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

#Область ТекстЗапроса

Функция ТекстЗапроса_втСтоимостьВНАПУ(НомераТаблиц)
	
	НомераТаблиц.Вставить("втСтоимостьВНАПУ", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	втСтоимость.ВНА КАК ВНА,
	|	втСтоимость.ГруппаВНА КАК ГруппаВНА,
	|	втСтоимость.ВидУчета КАК ВидУчета,
	|	втСтоимость.СуммаВВалютеУчетаОборот КАК СуммаВВалютеУчета,
	|	втСтоимость.АмортизацияОборот КАК Амортизация,
	|	втСтоимость.ПереоценкаОборот КАК Переоценка,
	|	втСтоимость.ОбесценениеОборот КАК Обесценение,
	|	втСтоимость.ПереоценкаАмортизацииОборот КАК ПереоценкаАмортизации,
	|	втСтоимость.РезервПереоценкиОборот КАК РезервПереоценки,
	|	втСтоимость.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ втСтоимостьВНАПУ
	|ИЗ
	|	РегистрНакопления.СтоимостьВНАМСФО.Обороты(
	|			,
	|			&ГраницаДоДокумента {(&ГраницаДоДокумента)},
	|			,
	|			Сценарий = &Сценарий
	|				И ВЫБОР
	|					КОГДА &ВсеОрганизации
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Организация В (&Организация)
	|				КОНЕЦ
	|				И ВидУчета В (&ВидыУчета)
	|				И ВЫБОР
	|					КОГДА &ВсеВНА
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ВНА В (&ВНА)
	|				КОНЕЦ) КАК втСтоимость
	|ГДЕ
	|	втСтоимость.СуммаВВалютеУчетаОборот <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВНА,
	|	ГруппаВНА,
	|	ВидУчета";
	
КонецФункции

Функция ТекстЗапроса_втРазделыВНА(НомераТаблиц)
	
	НомераТаблиц.Вставить("втРазделыВНА", НомераТаблиц.Количество());

	Возврат
	"ВЫБРАТЬ
	|	т.Ссылка КАК РазделПланаСчетов,
	|	ИСТИНА КАК ЭтоВНА
	|ПОМЕСТИТЬ втРазделыВНА
	|ИЗ
	|	Справочник.РазделыПланаСчетов КАК т
	|ГДЕ
	|	т.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.РазделыПланаСчетов.ВнеоборотныеАктивы), ЗНАЧЕНИЕ(Справочник.РазделыПланаСчетов.НезавершенноеСтроительство))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	т.Ссылка,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.РазделыПланаСчетов КАК т
	|ГДЕ
	|	т.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.РазделыПланаСчетов.Капитал))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РазделПланаСчетов";

КонецФункции

Функция ТекстЗапроса_втСчетаТрансляцииВНА(НомераТаблиц)
	
	НомераТаблиц.Вставить("втСчетаТрВНА", НомераТаблиц.Количество());
	
	// ОВНА - счет обесценения ВНА, отличается от счета переоценки(ПВНА), тем что используется в настройках обесценения
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	т.Ссылка КАК Счет,
	|	т.СчетСсылка КАК СчетСсылка,
	|	ВЫБОР
	|		КОГДА &Тип1
	|			ТОГДА 1
	|		КОГДА &Тип2
	|			ТОГДА 2
	|		КОГДА &Тип3
	|			ТОГДА 3
	|	КОНЕЦ КАК НомерСубконтоВНА,
	|	ВЫБОР
	|		КОГДА втРазделыВНА.ЭтоВНА
	|				И т.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовБД.Пассивный)
	|			ТОГДА ""АВНА""
	|		КОГДА втРазделыВНА.ЭтоВНА
	|				И т.Вид <> ЗНАЧЕНИЕ(Перечисление.ВидыСчетовБД.Пассивный)
	|			ТОГДА ""ВНА""
	|		КОГДА т.Ссылка В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					п.СчетНакопленногоОбесценения
	|				ИЗ
	|					Справочник.ПараметрыОбесцененияВНАМСФО КАК п
	|				ГДЕ
	|					НЕ п.ПометкаУдаления)
	|			ТОГДА ""ОВНА""
	|		ИНАЧЕ ""ПВНА""
	|	КОНЕЦ КАК РольСчета
	|ПОМЕСТИТЬ втСчетаТрВНА
	|ИЗ
	|	Справочник.СчетаБД КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРазделыВНА КАК втРазделыВНА
	|		ПО т.РазделПланаСчетов = втРазделыВНА.РазделПланаСчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК ВидСубконто1
	|		ПО т.Ссылка = ВидСубконто1.Ссылка
	|			И (ВидСубконто1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК ВидСубконто2
	|		ПО т.Ссылка = ВидСубконто2.Ссылка
	|			И (ВидСубконто2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК ВидСубконто3
	|		ПО т.Ссылка = ВидСубконто3.Ссылка
	|			И (ВидСубконто3.НомерСтроки = 3)
	|ГДЕ
	|	т.Владелец В
	|			(ВЫБРАТЬ
	|				пс.Ссылка
	|			ИЗ
	|				Справочник.ПланыСчетовБД КАК пс
	|			ГДЕ
	|				пс.ПланСчетовМСФО
	|				И пс.Владелец = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетСсылка,
	|	НомерСубконтоВНА";
	
	ШаблонПодобно = "ВидСубконто_1.ТипДанных ПОДОБНО ""%._2%"" ";
	ШаблонСубконто = Новый Массив;
	ТипыВНА = Метаданные.ОпределяемыеТипы.ВНА.Тип.Типы();
	Для каждого ТипВНА Из ТипыВНА Цикл
		ИмяВНА = Метаданные.НайтиПоТипу(ТипВНА).Имя;
		ШаблонСубконто.Добавить(СтрЗаменить(ШаблонПодобно, "_2", ИмяВНА));
	КонецЦикла;
	Шаблон = СтрСоединить(ШаблонСубконто, " ИЛИ ");
	
	Для НомерСубконто = 1 По 3 Цикл
		Замена = СтрЗаменить(Шаблон, "_1", НомерСубконто);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Тип" + НомерСубконто, Замена);
	КонецЦикла;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапроса_втПараметрыУчетаВНАМСФО(НомераТаблиц)
	
	НомераТаблиц.Вставить("втПараметрыУчетаВНАМСФО", НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ
	|	ПараметрыУчета.ВНА КАК ВНА,
	|	ПараметрыУчета.ГруппаВНА КАК ГруппаВНА,
	|	ПараметрыУчета.ВидУчета КАК ВидУчета,
	|	ПараметрыУчета.СпособПоступления КАК СпособПоступления,
	|	ПараметрыУчета.СчетУчетаПервоначальнойСтоимости КАК СчетУчетаПервоначальнойСтоимости,
	|	ПараметрыУчета.СчетУчетаПервоначальнойСтоимостиСубконто1 КАК СчетУчетаПервоначальнойСтоимостиСубконто1,
	|	ПараметрыУчета.СчетУчетаПервоначальнойСтоимостиСубконто2 КАК СчетУчетаПервоначальнойСтоимостиСубконто2,
	|	ПараметрыУчета.СчетУчетаПервоначальнойСтоимостиСубконто3 КАК СчетУчетаПервоначальнойСтоимостиСубконто3,
	|	ПараметрыУчета.СчетНакопленнойАмортизации КАК СчетНакопленнойАмортизации,
	|	ПараметрыУчета.СчетНакопленнойАмортизацииСубконто1 КАК СчетНакопленнойАмортизацииСубконто1,
	|	ПараметрыУчета.СчетНакопленнойАмортизацииСубконто2 КАК СчетНакопленнойАмортизацииСубконто2,
	|	ПараметрыУчета.СчетНакопленнойАмортизацииСубконто3 КАК СчетНакопленнойАмортизацииСубконто3,
	|	ПараметрыУчета.Период КАК ДатаВвода,
	|	ПараметрыУчета.Регистратор КАК ДокументВвода,
	|	ПараметрыУчета.Подразделение КАК Подразделение,
	|	ПараметрыУчета.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ втПараметрыУчетаВНАМСФО
	|ИЗ
	|	РегистрСведений.ПараметрыУчетаВНАМСФО.СрезПоследних(
	|			&ГраницаДоДокумента {(&ГраницаДоДокумента)},
	|			ВЫБОР
	|					КОГДА &ВсеОрганизации
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Организация В (&Организация)
	|				КОНЕЦ
	|				И Сценарий = &Сценарий
	|				И ВидУчета В (&ВидыУчета)
	|				И ВНА В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						втСтоимостьВНАПУ.ВНА
	|					ИЗ
	|						втСтоимостьВНАПУ КАК втСтоимостьВНАПУ)) КАК ПараметрыУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПараметрыУчета.ВНА,
	|	ПараметрыУчета.ВидУчета,
	|	ПараметрыУчета.ГруппаВНА";
	
КонецФункции

Функция ТекстЗапроса_втСтоимостьВНАМСФО(НомераТаблиц, ЕстьТУВНА = Ложь)
	
	НомераТаблиц.Вставить("втСтоимостьВНАМСФО", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	т.ВНА КАК ВНА,
	|	т.ГруппаВНА КАК ГруппаВНА,
	|	т.ВидУчета КАК ВидУчета,
	|	т.СуммаВВалютеУчета КАК СуммаВВалютеУчета,
	|	т.Амортизация КАК Амортизация,
	|	т.Переоценка КАК Переоценка,
	|	т.Обесценение КАК Обесценение,
	|	т.ПереоценкаАмортизации КАК ПереоценкаАмортизации,
	|	т.РезервПереоценки КАК РезервПереоценки,
	|	т.Количество КАК Количество,
	|	п.ДокументВвода КАК ДокументВвода,
	|	п.Подразделение КАК Подразделение,
	|	п.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	п.СпособПоступления КАК СпособПоступления,
	|	п.ДатаВвода КАК ДатаВвода,
	|	п.СчетУчетаПервоначальнойСтоимости КАК СчетУчетаПервоначальнойСтоимости,
	|	п.СчетУчетаПервоначальнойСтоимостиСубконто1 КАК СчетУчетаПервоначальнойСтоимостиСубконто1,
	|	п.СчетУчетаПервоначальнойСтоимостиСубконто2 КАК СчетУчетаПервоначальнойСтоимостиСубконто2,
	|	п.СчетУчетаПервоначальнойСтоимостиСубконто3 КАК СчетУчетаПервоначальнойСтоимостиСубконто3,
	|	п.СчетНакопленнойАмортизации КАК СчетНакопленнойАмортизации,
	|	п.СчетНакопленнойАмортизацииСубконто1 КАК СчетНакопленнойАмортизацииСубконто1,
	|	п.СчетНакопленнойАмортизацииСубконто2 КАК СчетНакопленнойАмортизацииСубконто2,
	|	п.СчетНакопленнойАмортизацииСубконто3 КАК СчетНакопленнойАмортизацииСубконто3
	|ПОМЕСТИТЬ втСтоимостьВНАМСФО
	|ИЗ
	|	втСтоимостьВНАПУ КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПараметрыУчетаВНАМСФО КАК п
	|		ПО т.ВНА = п.ВНА
	|			И т.ГруппаВНА = п.ГруппаВНА
	|			И т.ВидУчета = п.ВидУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР втСчетаТрВНА.НомерСубконтоВНА
	|		КОГДА 1
	|			ТОГДА т.Субконто1
	|		КОГДА 2
	|			ТОГДА т.Субконто2
	|		КОГДА 3
	|			ТОГДА т.Субконто3
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.ГруппыВНАМСФО.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыУчета.МСФО),
	|	СУММА(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""ВНА""
	|				ТОГДА т.СуммаВВалютеУчетаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""АВНА""
	|				ТОГДА т.СуммаВВалютеУчетаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""ПВНА""
	|				ТОГДА т.СуммаВВалютеУчетаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""ОВНА""
	|				ТОГДА т.СуммаВВалютеУчетаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	0,
	|	0,
	|	ЕСТЬNULL(СУММА(т.КоличествоОстаток), 1),
	|	НЕОПРЕДЕЛЕНО,
	|	т.Подразделение,
	|	т.НаправлениеДеятельности,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыПоступленияОбъектовВНА.Приобретено),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""ВНА""
	|				ТОГДА втСчетаТрВНА.Счет
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""ВНА""
	|				ТОГДА т.Субконто1
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""ВНА""
	|				ТОГДА т.Субконто2
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""ВНА""
	|				ТОГДА т.Субконто3
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""АВНА""
	|				ТОГДА втСчетаТрВНА.Счет
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""АВНА""
	|				ТОГДА т.Субконто1
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""АВНА""
	|				ТОГДА т.Субконто2
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""ВНА""
	|				ТОГДА т.Субконто3
	|		КОНЕЦ)
	|ИЗ
	|	РегистрБухгалтерии.МСФО.Остатки(
	|			&ГраницаДоДокумента {(&ГраницаДоДокумента)},
	|			Счет В
	|				(ВЫБРАТЬ
	|					втСчетаТрВНА.СчетСсылка
	|				ИЗ
	|					втСчетаТрВНА КАК втСчетаТрВНА
	|				ГДЕ
	|					втСчетаТрВНА.НомерСубконтоВНА > 0),
	|			,
	|			Сценарий = &Сценарий
	|				И &ЕстьТУВНА
	|				И ВЫБОР
	|					КОГДА &ВсеОрганизации
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Организация В (&Организация)
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ВсеВНА
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Субконто1 В (&ВНА)
	|				КОНЕЦ
	|				И НЕ Субконто1 В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							т.ВНА
	|						ИЗ
	|							втСтоимостьВНАПУ КАК т)
	|				И НЕ Субконто2 В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							т.ВНА
	|						ИЗ
	|							втСтоимостьВНАПУ КАК т)
	|				И НЕ Субконто3 В
	|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|							т.ВНА
	|						ИЗ
	|							втСтоимостьВНАПУ КАК т)) КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСчетаТрВНА КАК втСчетаТрВНА
	|		ПО т.Счет = втСчетаТрВНА.СчетСсылка
	|ГДЕ
	|	ВЫБОР втСчетаТрВНА.НомерСубконтоВНА
	|			КОГДА 1
	|				ТОГДА т.Субконто1
	|			КОГДА 2
	|				ТОГДА т.Субконто2
	|			КОГДА 3
	|				ТОГДА т.Субконто3
	|		КОНЕЦ <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР втСчетаТрВНА.НомерСубконтоВНА
	|		КОГДА 1
	|			ТОГДА т.Субконто1
	|		КОГДА 2
	|			ТОГДА т.Субконто2
	|		КОГДА 3
	|			ТОГДА т.Субконто3
	|	КОНЕЦ,
	|	т.Подразделение,
	|	т.НаправлениеДеятельности
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА втСчетаТрВНА.РольСчета = ""ВНА""
	|				ТОГДА т.СуммаВВалютеУчетаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВНА,
	|	ВидУчета";
	
	Возврат СтрЗаменить(ТекстЗапроса, "&ЕстьТУВНА", ?(ЕстьТУВНА, "ИСТИНА", "ЛОЖЬ"));
	
КонецФункции

Функция ТекстЗапроса_втПараметрыАмортизацииВНАМСФО(НомераТаблиц)

	НомераТаблиц.Вставить("втПараметрыАмортизацииВНАМСФО", НомераТаблиц.Количество());

	Возврат
	"ВЫБРАТЬ
	|	т.ВНА КАК ВНА,
	|	т.ВидУчета КАК ВидУчета,
	|	т.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ВЫБОР
	|		КОГДА НЕ т.НачислятьАмортизацию
	|			ТОГДА ЛОЖЬ
	|		КОГДА т.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВНА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ИСТИНА
	|		КОГДА т.СрокИспользованияДляВычисленияАмортизации > (ВЫРАЗИТЬ(т.СрокИспользованияДляВычисленияАмортизации КАК ЧИСЛО(18, 0)))
	|			ТОГДА ДОБАВИТЬКДАТЕ(т.Период, МЕСЯЦ, 1 + (ВЫРАЗИТЬ(т.СрокИспользованияДляВычисленияАмортизации КАК ЧИСЛО(18, 0)))) >= &ДатаРасчета
	|		КОГДА НЕ &АлгоритмРСБУ
	|			ТОГДА ДОБАВИТЬКДАТЕ(т.Период, МЕСЯЦ, (ВЫРАЗИТЬ(т.СрокИспользованияДляВычисленияАмортизации КАК ЧИСЛО(18, 0)))) >= &ДатаНачалаПериодаДокумента
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(т.Период, МЕСЯЦ, ВЫРАЗИТЬ(т.СрокИспользованияДляВычисленияАмортизации КАК ЧИСЛО(18, 0))) >= &ДатаРасчета
	|	КОНЕЦ КАК НачислятьАмортизацию,
	|	т.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	т.ЛиквидационнаяСтоимость КАК ЛиквидационнаяСтоимость,
	|	т.КоэффициентУскорения КАК КоэффициентУскорения,
	|	т.СпособОтраженияРасходовПоАмортизации КАК ПрофильРаспределения,
	|	т.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	т.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	т.ОбъемПродукцииРабот КАК ОбъемПродукцииРабот,
	|	т.ПараметрыАмортизации КАК ПараметрыАмортизации,
	|	т.ПараметрВыработки КАК ПараметрВыработки,
	|	ВЫБОР
	|		КОГДА т.Регистратор ССЫЛКА Документ.ВыбытиеВНАМСФО
	|			ТОГДА т.Период
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ДатаВыбытия,
	|	т.Период КАК ДатаПоследнегоСобытия,
	|	ВЫБОР
	|		КОГДА т.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВНА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЛОЖЬ
	|		КОГДА т.СрокИспользованияДляВычисленияАмортизации > (ВЫРАЗИТЬ(т.СрокИспользованияДляВычисленияАмортизации КАК ЧИСЛО(18, 0)))
	|			ТОГДА ДОБАВИТЬКДАТЕ(т.Период, МЕСЯЦ, 1 + (ВЫРАЗИТЬ(т.СрокИспользованияДляВычисленияАмортизации КАК ЧИСЛО(18, 0)))) МЕЖДУ &ДатаНачалаПериодаДокумента И КОНЕЦПЕРИОДА(&ДатаНачалаПериодаДокумента, МЕСЯЦ)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(т.Период, МЕСЯЦ, ВЫРАЗИТЬ(т.СрокИспользованияДляВычисленияАмортизации КАК ЧИСЛО(18, 0))) МЕЖДУ &ДатаНачалаПериодаДокумента И КОНЕЦПЕРИОДА(&ДатаНачалаПериодаДокумента, МЕСЯЦ)
	|	КОНЕЦ КАК ЭтоПоследнийПериодНачисления,
	|	т.Период >= &ДатаНачалаПериодаДокумента КАК ЕстьИзмененияМесяца,
	|	ВЫБОР
	|		КОГДА т.Регистратор ССЫЛКА Документ.ВыбытиеВНАМСФО
	|			ТОГДА т.Регистратор
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ДокументВыбытия,
	|	т.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ втПараметрыАмортизацииВНАМСФО
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииВНАМСФО.СрезПоследних(
	|			&ГраницаДоДокумента {(&ГраницаДоДокумента)},
	|			ВЫБОР
	|					КОГДА &ВсеОрганизации
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ Организация В (&Организация)
	|				КОНЕЦ
	|				И Сценарий = &Сценарий
	|				И ВидУчета В (&ВидыУчета)
	|				И ВНА В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						втСтоимостьВНАМСФО.ВНА
	|					ИЗ
	|						втСтоимостьВНАМСФО КАК втСтоимостьВНАМСФО)) КАК т
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидУчета,
	|	ВНА,
	|	СпособНачисленияАмортизации";
	
КонецФункции

Функция ТекстЗапроса_втВыработкаВНА(НомераТаблиц)

	НомераТаблиц.Вставить("втВыработкаВНА", НомераТаблиц.Количество());

	Возврат	
	"ВЫБРАТЬ
	|	ВыработкаВНА.ВНА КАК ВНА,
	|	ВыработкаВНА.ПараметрВыработки КАК ПараметрВыработки,
	|	ВыработкаВНА.ВидУчета КАК ВидУчета,
	|	СУММА(ВыработкаВНА.КоличествоОборот) КАК Количество
	|ПОМЕСТИТЬ втВыработкаВНА
	|ИЗ
	|	РегистрНакопления.ВыработкаВНА.Обороты(
	|			НАЧАЛОПЕРИОДА(&ДатаНачалаПериодаДокумента, МЕСЯЦ) {(НАЧАЛОПЕРИОДА(&ДатаНачалаПериодаДокумента, МЕСЯЦ)) КАК ПериодВыработка},
	|			КОНЕЦПЕРИОДА(&ДатаНачалаПериодаДокумента, МЕСЯЦ){(КОНЕЦПЕРИОДА(&ДатаНачалаПериодаДокумента, МЕСЯЦ)) КАК ПериодВыработка},
	|			ДЕНЬ,
	|			Сценарий = &Сценарий
	|				И Организация = &Организация) КАК ВыработкаВНА
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПараметрыАмортизацииВНАМСФО КАК втПоследниеСобытия
	|		ПО ВыработкаВНА.ВНА = втПоследниеСобытия.ВНА
	|			И (втПоследниеСобытия.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.МСФО))
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ ЕСТЬNULL(втПоследниеСобытия.ЕстьИзмененияМесяца, ЛОЖЬ)
	|				ТОГДА ИСТИНА
	|			КОГДА &АлгоритмРСБУ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВыработкаВНА.Период МЕЖДУ втПоследниеСобытия.ДатаПоследнегоСобытия И &ДатаРасчета
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыработкаВНА.ВНА,
	|	ВыработкаВНА.ПараметрВыработки,
	|	ВыработкаВНА.ВидУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВыработкаВНА.ВНА,
	|	ВыработкаВНА.ПараметрВыработки,
	|	ВыработкаВНА.ВидУчета";
	
КонецФункции

Функция ТекстЗапроса_втБазыРасчета(НомераТаблиц)
	
	НомераТаблиц.Вставить("втБазыРасчета", НомераТаблиц.Количество());

	Возврат
	"ВЫБРАТЬ
	|	втПараметрыУчетаВНАМСФО.ВНА КАК ВНА,
	|	втПараметрыУчетаВНАМСФО.ГруппаВНА КАК ГруппаВНА,
	|	ВЫБОР
	|		КОГДА втПараметрыАмортизацииВНАМСФО.НачислятьАмортизацию = ЛОЖЬ
	|			ТОГДА 0
	|		КОГДА втПараметрыАмортизацииВНАМСФО.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВНА.Линейный)
	|			ТОГДА ВЫБОР
	|					КОГДА &АлгоритмРСБУ
	|						ТОГДА втПараметрыАмортизацииВНАМСФО.СрокИспользованияДляВычисленияАмортизации
	|					ИНАЧЕ РАЗНОСТЬДАТ(&ДатаРасчета, ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, ЦЕЛ(втПараметрыАмортизацииВНАМСФО.СрокИспользованияДляВычисленияАмортизации)), ДЕНЬ) + ОКР(30 * (втПараметрыАмортизацииВНАМСФО.СрокИспользованияДляВычисленияАмортизации - ЦЕЛ(втПараметрыАмортизацииВНАМСФО.СрокИспользованияДляВычисленияАмортизации)), 0)
	|				КОНЕЦ
	|		КОГДА втПараметрыАмортизацииВНАМСФО.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВНА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ОбъемПродукцииРабот, 0)
	|		КОГДА втПараметрыАмортизацииВНАМСФО.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВНА.УменьшаемогоОстатка)
	|			ТОГДА ВЫБОР
	|					КОГДА &АлгоритмРСБУ
	|						ТОГДА втПараметрыАмортизацииВНАМСФО.СрокИспользованияДляВычисленияАмортизации
	|					ИНАЧЕ РАЗНОСТЬДАТ(&ДатаРасчета, ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, ЦЕЛ(втПараметрыАмортизацииВНАМСФО.СрокИспользованияДляВычисленияАмортизации)), ДЕНЬ) + ОКР(30 * (втПараметрыАмортизацииВНАМСФО.СрокИспользованияДляВычисленияАмортизации - ЦЕЛ(втПараметрыАмортизацииВНАМСФО.СрокИспользованияДляВычисленияАмортизации)), 0)
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК БазаРасчета,
	|	втВыработкаВНА.Количество КАК Количество
	|ПОМЕСТИТЬ втБазыРасчета
	|ИЗ
	|	втПараметрыАмортизацииВНАМСФО КАК втПараметрыАмортизацииВНАМСФО
	|		{ЛЕВОЕ СОЕДИНЕНИЕ втВыработкаВНА КАК втВыработкаВНА
	|		ПО втПараметрыАмортизацииВНАМСФО.ВНА = втВыработкаВНА.ВНА
	|			И втПараметрыАмортизацииВНАМСФО.ВидУчета = втВыработкаВНА.ВидУчета
	|			И втПараметрыАмортизацииВНАМСФО.ПараметрВыработки = втВыработкаВНА.ПараметрВыработки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПараметрыУчетаВНАМСФО КАК втПараметрыУчетаВНАМСФО
	|		ПО втПараметрыАмортизацииВНАМСФО.ВНА = втПараметрыУчетаВНАМСФО.ВНА
	|			И (втПараметрыАмортизацииВНАМСФО.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.МСФО))
	|			И (втПараметрыУчетаВНАМСФО.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.МСФО))}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВНА,
	|	ГруппаВНА";
	
КонецФункции

Функция ТекстЗапроса_ТаблицаПараметрыВНА(НомераТаблиц, ТаблицаДляПомещения = Неопределено)

	НомераТаблиц.Вставить("ТаблицаПараметрыВНА", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	втСтоимостьВНАМСФО.ВНА КАК ВНА,
	|	втСтоимостьВНАМСФО.ВидУчета КАК ВидУчета,
	|	втСтоимостьВНАМСФО.ГруппаВНА КАК ГруппаВНА,
	|	ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.НачислятьАмортизацию, ЛОЖЬ) КАК НачислятьАмортизацию,
	|	втПараметрыАмортизацииВНАМСФО.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	втПараметрыАмортизацииВНАМСФО.ПрофильРаспределения КАК ПрофильРаспределения,
	|	втПараметрыАмортизацииВНАМСФО.СрокПолезногоИспользования КАК СПИ,
	|	ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимость,
	|	втПараметрыАмортизацииВНАМСФО.КоэффициентУскорения КАК КоэффициентУскорения,
	|	ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) КАК ПервоначальнаяСтоимость,
	|	ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0) КАК Амортизация,
	|	ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) КАК Переоценка,
	|	ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0) КАК Обесценение,
	|	ЕСТЬNULL(втСтоимостьВНАМСФО.ПереоценкаАмортизации, 0) КАК ПереоценкаАмортизации,
	|	ЕСТЬNULL(втСтоимостьВНАМСФО.РезервПереоценки, 0) КАК РезервПереоценки,
	|	ЕСТЬNULL(втСтоимостьВНАМСФО.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ОбъемПродукцииРабот, 0) КАК ОбъемПродукцииРабот,
	|	ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ПараметрВыработки, 0) КАК ПараметрВыработки,
	|	ЕСТЬNULL(втВыработкаВНА.Количество, 0) КАК ВыработкаЗаПериод,
	|	втСтоимостьВНАМСФО.СпособПоступления КАК СпособПоступления,
	|	втСтоимостьВНАМСФО.ДатаВвода КАК ДатаВвода,
	|	втПараметрыАмортизацииВНАМСФО.ДатаВыбытия КАК ДатаВыбытия,
	|	втСтоимостьВНАМСФО.СчетУчетаПервоначальнойСтоимости КАК СчетУчетаПервоначальнойСтоимости,
	|	втСтоимостьВНАМСФО.СчетУчетаПервоначальнойСтоимостиСубконто1 КАК СчетУчетаПервоначальнойСтоимостиСубконто1,
	|	втСтоимостьВНАМСФО.СчетУчетаПервоначальнойСтоимостиСубконто2 КАК СчетУчетаПервоначальнойСтоимостиСубконто2,
	|	втСтоимостьВНАМСФО.СчетУчетаПервоначальнойСтоимостиСубконто3 КАК СчетУчетаПервоначальнойСтоимостиСубконто3,
	|	втСтоимостьВНАМСФО.СчетНакопленнойАмортизации КАК СчетНакопленнойАмортизации,
	|	втСтоимостьВНАМСФО.СчетНакопленнойАмортизацииСубконто1 КАК СчетНакопленнойАмортизацииСубконто1,
	|	втСтоимостьВНАМСФО.СчетНакопленнойАмортизацииСубконто2 КАК СчетНакопленнойАмортизацииСубконто2,
	|	втСтоимостьВНАМСФО.СчетНакопленнойАмортизацииСубконто3 КАК СчетНакопленнойАмортизацииСубконто3,
	|	втПараметрыАмортизацииВНАМСФО.ДатаПоследнегоСобытия КАК ДатаПоследнегоСобытия,
	|	ВЫБОР
	|		КОГДА втСтоимостьВНАМСФО.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НСБУ)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЛиквидационнаяСтоимость, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0) - ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0) <= 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.СтоимостьДляВычисленияАмортизации, 0)
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|	втПараметрыАмортизацииВНАМСФО.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА втСтоимостьВНАМСФО.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НСБУ)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЛиквидационнаяСтоимость, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0) <= ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0)
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0)
	|	КОНЕЦ КАК БалансоваяСтоимость,
	|	ВЫБОР
	|		КОГДА втСтоимостьВНАМСФО.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НСБУ)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЛиквидационнаяСтоимость, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0) - ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0) <= 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЭтоПоследнийПериодНачисления, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЛиквидационнаяСтоимость, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0) - ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0)
	|		ИНАЧЕ ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.СтоимостьДляВычисленияАмортизации, 0)
	|	КОНЕЦ * ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.НачислятьАмортизацию, ЛОЖЬ)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(втБазыРасчета.БазаРасчета, 0) <= 0
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЭтоПоследнийПериодНачисления, ЛОЖЬ)
	|			ТОГДА 1
	|		КОГДА втПараметрыАмортизацииВНАМСФО.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВНА.Линейный)
	|			ТОГДА ВЫБОР
	|					КОГДА &АлгоритмРСБУ
	|						ТОГДА 1
	|					КОГДА &ДатаНачалаПериодаДокумента > ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ДатаПоследнегоСобытия, ДАТАВРЕМЯ(1, 1, 1))
	|						ТОГДА РАЗНОСТЬДАТ(&ДатаНачалаПериодаДокумента, &ДатаРасчета, ДЕНЬ) + 1
	|					ИНАЧЕ РАЗНОСТЬДАТ(втПараметрыАмортизацииВНАМСФО.ДатаПоследнегоСобытия, &ДатаРасчета, ДЕНЬ)
	|				КОНЕЦ
	|		КОГДА втПараметрыАмортизацииВНАМСФО.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВНА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(втБазыРасчета.БазаРасчета, 0) = 0
	|						ТОГДА 0
	|					КОГДА ЕСТЬNULL(втБазыРасчета.БазаРасчета, 0) * (ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0)) / втСтоимостьВНАМСФО.СуммаВВалютеУчета <= ЕСТЬNULL(втБазыРасчета.Количество, 0)
	|						ТОГДА ЕСТЬNULL(втБазыРасчета.БазаРасчета, 0) * (ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0)) / втСтоимостьВНАМСФО.СуммаВВалютеУчета
	|					ИНАЧЕ ЕСТЬNULL(втБазыРасчета.Количество, 0)
	|				КОНЕЦ
	|		КОГДА втПараметрыАмортизацииВНАМСФО.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВНА.УменьшаемогоОстатка)
	|			ТОГДА втПараметрыАмортизацииВНАМСФО.КоэффициентУскорения
	|		ИНАЧЕ 0
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЭтоПоследнийПериодНачисления, ЛОЖЬ)
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(втБазыРасчета.БазаРасчета, 0) <= 0
	|			ТОГДА 1
	|		ИНАЧЕ втБазыРасчета.БазаРасчета
	|	КОНЕЦ КАК АмортизацияРасчет,
	|	ВЫБОР
	|		КОГДА ИСТИНА В
	|				(ВЫБРАТЬ
	|					ИСТИНА
	|				ИЗ
	|					Константа.УчетРезервовПоПереоценкеВНА КАК т
	|				ГДЕ
	|					т.Значение = ЗНАЧЕНИЕ(Перечисление.СпособыУчетаРезервовПоПереоценкеВНАМСФО.СписаниеПриВыбытии))
	|			ТОГДА 0
	|		КОГДА втСтоимостьВНАМСФО.РезервПереоценки <= 0
	|			ТОГДА 0
	|		КОГДА втСтоимостьВНАМСФО.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НСБУ)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЛиквидационнаяСтоимость, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0) <= ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0)
	|			ТОГДА 0
	|		ИНАЧЕ втСтоимостьВНАМСФО.РезервПереоценки / (ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0))
	|	КОНЕЦ * ВЫБОР
	|		КОГДА втСтоимостьВНАМСФО.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НСБУ)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЛиквидационнаяСтоимость, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0) - ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0) <= 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЭтоПоследнийПериодНачисления, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЛиквидационнаяСтоимость, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0) - ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0)
	|		ИНАЧЕ ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.СтоимостьДляВычисленияАмортизации, 0)
	|	КОНЕЦ * ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.НачислятьАмортизацию, ЛОЖЬ)
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(втБазыРасчета.БазаРасчета, 0) <= 0
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЭтоПоследнийПериодНачисления, ЛОЖЬ)
	|			ТОГДА 1
	|		КОГДА втПараметрыАмортизацииВНАМСФО.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВНА.Линейный)
	|			ТОГДА ВЫБОР
	|					КОГДА &АлгоритмРСБУ
	|						ТОГДА 1
	|					КОГДА &ДатаНачалаПериодаДокумента > ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ДатаПоследнегоСобытия, ДАТАВРЕМЯ(1, 1, 1))
	|						ТОГДА РАЗНОСТЬДАТ(&ДатаНачалаПериодаДокумента, &ДатаРасчета, ДЕНЬ) + 1
	|					ИНАЧЕ РАЗНОСТЬДАТ(втПараметрыАмортизацииВНАМСФО.ДатаПоследнегоСобытия, &ДатаРасчета, ДЕНЬ)
	|				КОНЕЦ
	|		КОГДА втПараметрыАмортизацииВНАМСФО.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВНА.ПропорциональноОбъемуПродукции)
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(втБазыРасчета.БазаРасчета, 0) = 0
	|						ТОГДА 0
	|					КОГДА ЕСТЬNULL(втБазыРасчета.БазаРасчета, 0) * (ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0)) / втСтоимостьВНАМСФО.СуммаВВалютеУчета <= ЕСТЬNULL(втБазыРасчета.Количество, 0)
	|						ТОГДА ЕСТЬNULL(втБазыРасчета.БазаРасчета, 0) * (ЕСТЬNULL(втСтоимостьВНАМСФО.СуммаВВалютеУчета, 0) - ЕСТЬNULL(втСтоимостьВНАМСФО.Амортизация, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Переоценка, 0) + ЕСТЬNULL(втСтоимостьВНАМСФО.Обесценение, 0)) / втСтоимостьВНАМСФО.СуммаВВалютеУчета
	|					ИНАЧЕ ЕСТЬNULL(втБазыРасчета.Количество, 0)
	|				КОНЕЦ
	|		КОГДА втПараметрыАмортизацииВНАМСФО.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизацииВНА.УменьшаемогоОстатка)
	|			ТОГДА втПараметрыАмортизацииВНАМСФО.КоэффициентУскорения
	|		ИНАЧЕ 0
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ЕСТЬNULL(втПараметрыАмортизацииВНАМСФО.ЭтоПоследнийПериодНачисления, ЛОЖЬ)
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(втБазыРасчета.БазаРасчета, 0) <= 0
	|			ТОГДА 1
	|		ИНАЧЕ втБазыРасчета.БазаРасчета
	|	КОНЕЦ КАК РезервПереоценкиРасчет,
	|	втБазыРасчета.БазаРасчета КАК БазаРасчета,
	|	втСтоимостьВНАМСФО.ДокументВвода КАК ДокументВвода,
	|	втПараметрыАмортизацииВНАМСФО.ДокументВыбытия КАК ДокументВыбытия,
	|	втСтоимостьВНАМСФО.Подразделение КАК Подразделение,
	|	втСтоимостьВНАМСФО.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ПОМЕСТИТЬ втПараметрыВНА
	|ИЗ
	|	втСтоимостьВНАМСФО КАК втСтоимостьВНАМСФО
	|		{ЛЕВОЕ СОЕДИНЕНИЕ втПараметрыАмортизацииВНАМСФО КАК втПараметрыАмортизацииВНАМСФО
	|			{ЛЕВОЕ СОЕДИНЕНИЕ втБазыРасчета КАК втБазыРасчета
	|			ПО втПараметрыАмортизацииВНАМСФО.ВНА = втБазыРасчета.ВНА
	|				И (втПараметрыАмортизацииВНАМСФО.ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.МСФО))}
	|			{ЛЕВОЕ СОЕДИНЕНИЕ втВыработкаВНА КАК втВыработкаВНА
	|			ПО втПараметрыАмортизацииВНАМСФО.ВНА = втВыработкаВНА.ВНА
	|				И втПараметрыАмортизацииВНАМСФО.ВидУчета = втВыработкаВНА.ВидУчета
	|				И втПараметрыАмортизацииВНАМСФО.ПараметрВыработки = втВыработкаВНА.ПараметрВыработки}
	|		ПО втСтоимостьВНАМСФО.ВНА = втПараметрыАмортизацииВНАМСФО.ВНА
	|			И втСтоимостьВНАМСФО.ВидУчета = втПараметрыАмортизацииВНАМСФО.ВидУчета}";

	ТекстЗамены = "";
	Если ЗначениеЗаполнено(ТаблицаДляПомещения) Тогда
		ТекстЗамены = "ПОМЕСТИТЬ " + ТаблицаДляПомещения;
	КонецЕсли;
	
	Возврат СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ втПараметрыВНА", ТекстЗамены);
	 
КонецФункции

#КонецОбласти 

Функция ПолучитьДатыЗапросаПараметровВНА(ДокументДата, ДокументСсылка, АлгоритмРСБУ = Неопределено)

	Если АлгоритмРСБУ = Неопределено Тогда
		АлгоритмРСБУ = Константы.АлгоритмНачиcленияАмортизацииАналогичноРСБУ.Получить();
	КонецЕсли;
	
	Если АлгоритмРСБУ Тогда	
		Результат = ПолучитьДатыЗапросаАлгоритмРСБУ(ДокументДата, ДокументСсылка);
	Иначе 
		Результат = ПолучитьДатыЗапросаАлгоритмМСФО(ДокументДата, ДокументСсылка);
	КонецЕсли;
	
	Результат.Вставить("АлгоритмРСБУ", АлгоритмРСБУ);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатыЗапросаАлгоритмРСБУ(ДокументДата, ДокументСсылка)
	
	Результат = Новый Структура;
		
	ДатаРасчета = ?(ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВыбытиеВНАМСФО"), КонецМесяца(ДокументДата), КонецМесяца(ДобавитьМесяц(ДокументДата, -1)));
	
	//Расчет амортизации: если Документ: 
	//	НачислениеАмортизации - по правилам предыдущего месяца(но выработка текущего),
	//  Выбытие - за текущий месяц
	//  для других документов расчет не проводится
	
	Результат.Вставить("ДатаРасчета",					ДатаРасчета);//не используется в алгоритмеРСБУ
	Результат.Вставить("ГраницаДоДокумента",			Новый Граница(ДатаРасчета, ВидГраницы.Включая));
	Результат.Вставить("ДатаНачалаПериодаДокумента",	НачалоМесяца(ДокументДата));// используется для получения объема выработки за период
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатыЗапросаАлгоритмМСФО(ДокументДата, ДокументСсылка)
	
	Результат = Новый Структура;
	
	ДатаРасчета = ДокументДата;
	
	//рассчитывает амортизацию от макс(ДатаНачалаНачисления,ДатаПоследнегоСобытия) до ДатаРасчета
	Результат.Вставить("ДатаРасчета",					ДатаРасчета);
	Результат.Вставить("ГраницаДоДокумента", 			МСФОВызовСервераУХ.ПолучитьГраницуДоДокумента(ДатаРасчета, ДокументСсылка));
	Результат.Вставить("ДатаНачалаПериодаДокумента",	НачалоМесяца(ДатаРасчета));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
